app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`   ORDER BY created_at DESC
---
  def index
    @posts = Post.all.order("created_at DESC")

INSERT INTO `posts` (`content`, `created_at`, `title`, `updated_at`) VALUES ('bbggggg', '2014-07-17 06:38:11', 'tggggg', '2014-07-17 06:38:11')
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 23 LIMIT 1
UPDATE `posts` SET `content` = '22222222ssss', `updated_at` = '2014-07-17 08:50:11' WHERE `posts`.`id` = 23
---
def update
  @post = Post.find(params[:id])
if @post.update_attributes(post_params)